import { defineStore } from 'pinia'

interface ObjectItem {
  title: string;
  text: string;
  photos: string[];
}

interface ObjectsState {
  objects: Record<string, ObjectItem>;
}

export const useObjectsStore = defineStore('objects', {
  state: (): ObjectsState => ({
    objects: {
        'мост': {
            title: 'Мост через Генеральную балку',
            text: 'Мост, построенный по новому плану, обошелся в 16100 р. 93 1/2 к. с. В день Тезоименитства Его Императорского Величества Государя Императора 30 августа 1864 года Ростовская Городская Дума торжественно освятила мост и открыла чрез него проезд. В честь городского головы Андрея Матвеевича Байкова мост назван его именем',
            photos: [
              '/images/most/imgonline_com_ua_PicOnPic_Ows93UYrMmnVU.jpg',
              '/images/most/20109790.jpg',
              '/images/most/66650151.jpg',
            ],
        },
        'водопровод': {
            title: 'Водопровод',
            text: 'Первый водопровод из чугуна и камня длиной 5 км открылся в конце 1865 года. Насосная станция у Богатого источника подавала воду в резервуар на 250 м³',
            photos: [
                'images/vod/55u574f1ltvtr8lu8f.webp',
                'images/vod/2650075 Внутри английских фильтров Ростовской водопроводной станции - 4(1).jpg',
                'images/vod/2651810 План водопроводной станции города Ростова-на-Дону.jpg',
                'images/vod/a20xyx7xcs8skly76f.webp',
                'images/vod/bkue.jpg',
                'images/vod/dh8a9gcso3w8k900dm.webp',
                'images/vod/m89yclq9i8wg2xop99.webp',
                'images/vod/pervyy_vodoprovod1_0.jpg',
                'images/vod/rotold.jpg',
                'images/vod/uzid71ryobg58pq6ew.webp',
            ],
        },
        'канализация': {
            title: 'Канализация',
            text: 'В 1886 году «начата канализация всего города»',
            photos: [
              'images/kan/5nxyzwvzgr43ffii952orzrkp9j01qh8.jpg',
              'images/kan/2650071 Торжественная закладка перед строительством английский фильтров.jpg',
              'images/kan/2650074 Внутри английских фильтров Ростовской водопроводной станции - 5.jpg',
              'images/kan/xn8bhcfl1icjfapot2ntox81id50skt4.jpg',
              'images/kan/3yy9jayfytbkq11vui4d7prk4ky713zh.jpg',
            ],},
        'богадельня': {
            title: 'Петропавловская богадельня',
            text: '. Богадельня обозначалась на всех старых планах Ростова в границах целого квартала между сегодняшними ул. Красноармейской и Тельмана, а так же Буденовским проспектом и пер. Островского. ',
            photos: ['images/petr/2472581 Петропавловская богадельня в деталях.png'],},
        'гирла': {
            title: 'Расчистка донских гирл',
            text: 'Роль Ростова-на-Дону как торгового города Азово-Черноморского бассейна во многом зависела от судоходства в нижнем течении реки Дон. Оттуда путь к большой воде идет через дельту, представляющую собой множество мелких рукавов (гирл), впадающих в Азовское море. В начале 1865 года было «Высочайше» утверждено Положение о комитете донских гирл. В нем, в частности, говорилось о том, что он создается «с целью расчистки и поддержания гирл р. Дона в удобном для прохода судов состоянии, наблюдения за самым проходом судов и установления правильного в этом отношении порядка»',
            photos: [
                'images/girl/Очистка дна Дона от камней на территории Ростова-на-Дону.jpg',
                'images/girl/Титульный лист книги контр-адмирала П.Е. Белявского bhДонские гирлаor.jpg',
            ],
        },
        'санитарная лаборатория': {
            title: 'Санитарная служба',
            text: 'В 1874 году образован санитарный комитет, создана санитарная служба, «покончившая с холерой»',
            photos: ['images/control/604376469.jpg'],

        },
    },
  }),
  
  getters: {
    getObjects: (state) => state.objects,
    objectsNames: (state) => Object.keys(state.objects || {})
  },
})
