<template>
  <div v-for="key in Object.keys(items)">
    <div>{{ key }}</div>
    <!-- <div>{{ items[key] }}</div> -->
  </div>
</template>

<script setup lang="ts">
const items = {
  'Блестящий ученик': 'Окончил престижное Императорское училище правоведения первым в выпуске и с золотой медалью. За выдающиеся успехи его имя было выбито на мраморной доске в Конференц-зале училища.',
  'Отважный боец': 'В начале Крымской войны командовал дружиной государственного ополчения. 1 июня 1854 года принял бой против англо-французского флота на острове Равенсари в Финском заливе, где получил боевое ранение. После этого отправился на лечение на юг России, где навсегда связал свою жизнь с Ростовом.',
  'Кавалер орденов': 'За мужество и доблесть, проявленные в бою, награждён орденом Святой Анны III степени и Крестом Государственного ополчения. За многолетнюю государственную службу удостоен чина действительного статского советника',
  'Надёжный семьянин': 'Незадолго до переезда на Дон женился на дочери генерал- майора Прасковье Яковлевне Колодкиной.Супруга полностью разделяла идеи Байкова и поддерживала все сложные начинания мужа, пока в семье подросла их единственная дочь Ольга',
  'Честный прагматик': 'Ворочая миллионными городскими бюджетами и создавая мощные финансовые институты для Юга России, Байков не запускал руку в казну Ростова. Основной капитал его семья заработала во время его работы контрагентом Кавказских Минеральных Вод',
}
</script>
