<template>
  <div>
    {{ desciption }}
  </div>
  <div>
    {{ quote }}
  </div>
</template>

<script setup lang="ts">
const desciption = 'Речь гласного Ростовской думы Александра Бойченко (15 сентября 1862 года):'
const quote = 'Поставленному природою в самое выгодное положение, Ростову нужен был человек, который, соединяя светлый ум с несокрушимою волею, пробудил бы его от цепенеющего сна и двинул вперёд на ту дорогу, в конце которой — порядок, благоустройство и довольство. В лице Байкова Ростов встречает этого человека'
</script>
