<template>
  <h3>{{ title }}</h3>
  <v-img :width="255" aspect-ratio="4/3" cover src="/images/results/1.png"></v-img>
  <div>
    {{ populationGrowth.title }}
  </div>
  <div>
    {{ populationGrowth.text }}
  </div>
  <div>
    {{ tradeGrowth.title }}
  </div>
  <div>
    {{ tradeGrowth.text }}
  </div>
</template>

<script setup lang="ts">
const title = 'роста населения и торгового оборота'
const populationGrowth = {
  title: 'Как инфраструктура рождает мегаполис: рост населения Ростова при А. М. Байкове',
  text: 'График наглядно демонстрирует феномен "байковской эпохи": за 27 лет с момента прихода Андрея Байкова к власти население Ростова выросло более чем в 5 раз',
}
const tradeGrowth = {
  title: 'Преобразования Байкова в цифрах: ликвидация барьеров и триумф капитала',
  text: 'График отражает переход Ростова от хаотичной провинциальной торговли к статусу экономического лидера Юга России. До Байкова город задыхался без свободных денег. Создание Конторы Государственного банка (1861 г.) и Общества взаимного кредита дали местным купцам дешёвые оборотные кредиты, убрав зависимость от столичных ростовщиков. ',
}
</script>
