<template>
  <h3>{{ title }}</h3>
  <h5>{{ subtitle }}</h5>
  <div v-for="item in text">
    {{ item }}
  </div>
</template>

<script setup lang="ts">
const title = 'Ростов-на-Дону: город, которому было уготовано стать лидером'
const subtitle = 'Удачное положение — точка старта'
const text = [
  'Ростов изначально стоял на перекрёстке сухопутных и водных дорог, у выхода Дона к Азовскому морю. Ростов был известен двумя ярмарками, считавшимися одними из крупнейших в стране. Сюда стекалась сельскохозяйственная и промышленная продукция со всех уголков России. Помимо водных путей, значительная часть товаров, доставлялась в Ростов гужевым транспортом. В городе сходились пять крупнейших почтовых трактов того времени: Одесский, Бахмутский, Харьковский, Кавказский и Черноморский.',
  'В декабре 1749 г. императрица Елизавета Петровна своим указом учреждает в устье реки Темерник таможню. Вокруг Темерницкой таможни сосредотачивается заметная часть внешней торговли России. В 1776  происходит перенос таможни в Таганрог, а в 1836 году российское правительство вернуло таможню обратно в Ростов.',
  'Сама география говорила: городу нужен был только сильный управленец, чтобы превратить это преимущество в экономическую мощь.',
]
</script>
